# MEPAnalytical Segment Get Flow Transition Characteristic Method

Source: https://www.revitapidocs.com/2026/4400a9dc-c405-dcd4-e1c8-814647b943e7.htm

---

| MEPAnalytical Segment Get Flow Transition Characteristic Method |
| --- |

Gets the flow transition characteristic of the segment.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public FlowTransitionCharacteristic GetFlowTransitionCharacteristic(
	Document doc
)
```

```
Public Function GetFlowTransitionCharacteristic (
	doc As Document
) As FlowTransitionCharacteristic
```

```
public:
FlowTransitionCharacteristic GetFlowTransitionCharacteristic(
	Document^ doc
)
```

```
member GetFlowTransitionCharacteristic :
        doc : Document -> FlowTransitionCharacteristic
```

#### Parameters

doc Document
:   The document of this segment.

#### Return Value

FlowTransitionCharacteristic Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace